export const interfaceTexts = {
  home: {
    welcome: 'Добро пожаловать в наш Книжный угол. Какую историю вы хотите прочесть сегодня?',
    searchPlaceholder: 'Название, автор или ваше настроение...'
  },
  auth: {
    title: 'Добро пожаловать в Книжный угол. Назовите себя:',
    placeholderLogin: 'Ваш читательский билет или Email'
  },
  booking: {
    success: 'Книга бережно отложена. Мы сохраним её в вашем уголке. Ждём в гости!',
    emptyShelf: 'Ваш уголок пока пустует. Давайте найдём для него что-нибудь интересное?'
  },
  errors: {
    page404: 'Эта страница затерялась среди архивных стеллажей Книжного угла. Давайте вернёмся в главный зал.'
  }
};